{
  "username": "davis_big_dawg",
  "summary": {
    "total_posts": 59,
    "transcripts_found": 1,
    "transcripts_downloaded": 1,
    "failed": 1
  },
  "transcripts": [
    {
      "post_id": "7575304937580547342",
      "description": "#fyp #viral #schoollunch #mid #him ",
      "create_time": 1763763162,
      "transcript": "My name is Davis, and this is day 30 of reviewing school food. Um, today we got the burger, but I put it on a biscuit. Um, there's lettuce, tomato, and ketchup. Almost see how it is. Okay. A lot better with the biscuit. Um, I'll probably give that 6.5 out of 10. It's kind of dry, but it's still pretty good. Um, I think the tomatoes and the lettuce really add a lot. Um, but also, I was wondering, comment some, um, ideas you guys want for, like, some, uh, content? I mean, I feel like the school lunch is kind of getting boring, but, um, yeah, now we gotta. Tropical Lime Brawha Blast. Uh, zero sugar. Pretty good. What? One of my favorite sodas. I'll probably give this 8 out of 10. Well, thank you. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 318,
        "commentCount": 1924,
        "diggCount": 32900,
        "playCount": 173900,
        "shareCount": 399
      }
    },
    {
      "post_id": "7574969359844560141",
      "description": "#fyp #viral #mcdonalds #good #him ",
      "create_time": 1763685017,
      "transcript": "My name is Davis. Um, on a field trip today, so no school lunch. But we got McDonald's on the way back. Um, got chicken nuggets, French fries, and then a sweet and sour sauce. So let's try the nugget. Here you go. Okay. Nuggets good. It's nice and fresh. Crunchy. It's pretty good. I'll probably give it 7.5 out of 10. Alright, now we got a French fry. Here you go. Okay. Pretty good. Um, I think I like the chick fil A fries more. I'll probably give these seven out of 10. And then sweet and sour sauce. One of my favorite sauces. I love it. I'll probably give that 9 out of 10. Well, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 524,
        "commentCount": 1473,
        "diggCount": 43600,
        "playCount": 287000,
        "shareCount": 855
      }
    },
    {
      "post_id": "7574629113093229838",
      "description": "#fyp #viral #chickfila #him #good ",
      "create_time": 1763605799,
      "transcript": "My name is Davis. Um, today we're reviewing chick fil A. No lunch review cause they keep repeating the same foods, but um, hopefully they'll change it up soon. All right, uh, we got the chicken sandwich. Put some chick fil a sauce on there. Var. God. Pretty good. I really like the bun. Um, it's nice and soft. Chicken's pretty good. Overall, I'll give that 8.5 out of 10. Alright, now we got a French fry. Okay. Pretty good. Um, only place to get waffle fries from. Always Really Good. I'll probably give those 8 out of 10. And, um, the chick fil a sauce, it's more like a honey mustard based if you've never had it. Also really good. Chick fil a sauce. Probably like a 9.5 out of 10. Always love that. Well, thank you guys. I'll see you tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 624,
        "commentCount": 1470,
        "diggCount": 51000,
        "playCount": 279500,
        "shareCount": 915
      }
    },
    {
      "post_id": "7574180246979759373",
      "description": "#thanksgiving #fyp #viral #schoollunch #him ",
      "create_time": 1763501305,
      "transcript": "Davis, this is day 29. I think day 23 or day 30 of reviewing school food. Um, today we got the Thanksgiving lunch. Been looking forward to this. Kind of excited. First we got a. The Turkey. It looks like it's in a gravy. See how it is? Pretty good. Um, it's like shredded Turkey and gravy. It's pretty good. Probably need some salt and pepper though. I'll probably give that eight out of 10. It's definitely, definitely better than most. Alright, now we got, um, the stuffing. Okay. It's kind of mushy. It's alright though. I'll probably give that like a six out of 10. Um. Yeah. Alright, now we got our mashed potatoes. Pretty good. Um, you can tell us, like, the instant mashed potatoes. It's pretty good though. I'll probably give it a 7 out of 10. I think mixing the Turkey with that will be very good. Um, now we got some green beans. Okay. Um. Not the biggest green bean green bean guy. I'm more like a broccoli and stuff like that. It's kind of mushy. Um, I'll probably give those a 5 out of 10. Alright, now we got a apple cobbler. Pretty excited about this. Nice and hot. Definitely some seasoning. That's really good. I'll probably give that 8.5 out of 10. Well, thank you guys. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 459,
        "commentCount": 1150,
        "diggCount": 47500,
        "playCount": 261700,
        "shareCount": 686
      }
    },
    {
      "post_id": "7573851741700033805",
      "description": "#fyp #viral #schoollunch #mid #him ",
      "create_time": 1763424806,
      "transcript": "My name is Davis, and this is day 27 28 of reviewing school food. New lunch today. Pretty happy about that. Uh, we got a barbecue sandwich. No barbecue sauce. Kind of unfortunate, but very good. It's nice and moist. It's not dry. What I'm happy about. I'll give that, um, 7.5 out of 10. If it had barbecue sauce, it would probably be like a 9. Pretty good. Right now we got a curly fries and some ketchup. Oh, well, not that great today. It's kind of soggy. Kinda full 5 out of 10. And now we got a cheesy broccoli. Pretty good. Not that cheesy though. I'll give that 5.5 out of 10. Alright, now we got, um, apple juice. Pretty good. I love apple juice. I'll give that 8 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 351,
        "commentCount": 914,
        "diggCount": 40000,
        "playCount": 213000,
        "shareCount": 481
      }
    },
    {
      "post_id": "7573018843111607565",
      "description": "48-0 us winning #fyp #viral #good #him #football ",
      "create_time": 1763230886,
      "transcript": "My name is Davis. Uh, we're at the first playoff game for varsity. Um, let's. Let's review the concession stand food. Uh, we got a Zaxby's chicken sandwich. Okay. Um, I can definitely tell it's been sitting in there, um, but it's hard to like, keep it, uh, fresh cause they pre order it. Um, I'll give it a six out of 10. Alright, now we got some, um, popcorn. I love you, Davis. Alright, um, popcorn. It's not warm. It's nice and buttery and salty though. I'll give it five out of 10 for popcorn. All right, now we got, um, cool blue Gatorade, 58. Dak Smith Khamisi. Okay, pretty good. It's not my favorite flavor of Gatorade, but it's definitely like probably top five. Nine out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 487,
        "commentCount": 1186,
        "diggCount": 45500,
        "playCount": 259900,
        "shareCount": 508
      }
    },
    {
      "post_id": "7572707989178584334",
      "description": "#fyp #viral #good #him #steak ",
      "create_time": 1763158486,
      "transcript": "My name is Davis. Um, today we're at alpaca. I got the. I don't know the name of it, but it's steak, um, on some fries and then some rice. There's onions and some tomatoes. Um, yeah, let's. Let's try it out. I'll try the rest of the steak. ها يا كلب the rice is really really nice um the seasoning is really good um the steak is very very tender it's not like. Chewy that is really good. Um, I'll probably, give, that 9.5 out of 10 that is really good. And then here, I'll try it with, like, all the other stuff. Let me try this. Okay. The fries. Okay. The fries are really just, like. It's not crunchy at all. It's not. It's not what I want with the fry. The fries. And I'll probably give that 6.5 out of 10, but. What? The rice in the steak is really good. Um, yeah, very good. You guys should come down. Patty. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 463,
        "commentCount": 1205,
        "diggCount": 39000,
        "playCount": 214000,
        "shareCount": 515
      }
    },
    {
      "post_id": "7572392806510054669",
      "description": "#moessouthwestgrill #fyp #viral #him #good ",
      "create_time": 1763085118,
      "transcript": "My name is Davis. Um, no lunch review today because they keep repeating the same lunch. But, um, today we are trying Mose. Um, I have tried Chipotle. Um, now we got Mose. I got rice, adobo, chicken, sour cream, lettuce, um, tomatoes and cheese. And then do you have a little bit of queso? Here, try it with the queso. And without. Alright. Without, pretty good. Little bland. It's pretty good though. Um, I got like the value meal and get a small burrito, which is pretty big actually. Queso, chips and then a drink, um, for like 10 bucks. Really good deal. Um, let's try some queso on there. Scoop it with the chip, put it on there. Alright, here we go. Yeah, a lot better with the, um. With the queso. So without the queso, I'll probably give it 6.5 out of 10. With the queso, 7.5 out of 10. Well, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 575,
        "commentCount": 1250,
        "diggCount": 53500,
        "playCount": 321300,
        "shareCount": 707
      }
    },
    {
      "post_id": "7571954131267505421",
      "description": "#fyp #viral #him #schoollunch #good ",
      "create_time": 1762982988,
      "transcript": "My name is Davis, and this is day 27 of reviewing school food. Um, today we got orange chicken and rice. The rice, um, it's kind of hard. Um, it's okay. The chicken is really good, though. Overall, seven and a half out of 10. I really like this meal. Alright, now we got some, uh, cucumbers. Okay. Pretty good. Um, I mean, it's just cucumbers and ranch. I'll give it a 6 out of 10. Um, no drink today. Kind of a short lunch review, but, um, yeah, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 459,
        "commentCount": 1217,
        "diggCount": 54500,
        "playCount": 315600,
        "shareCount": 873
      }
    },
    {
      "post_id": "7571659999735418126",
      "description": "Thank you for the snacks @Bussin Snacks  #fyp #viral #snack #international #him ",
      "create_time": 1762914483,
      "transcript": "My name is Davis. Um, we have no school today since it's Veterans Day. It's also my birthday, which is pretty cool. Um, but for today's video, we're trying international Snacks. I have some laid out here. Um, yeah, so first we got. I got this Cherry, like, Coke product. I'm gonna pour it into a glass. Um, all these snacks are from Bussin Snacks, so. Thank you. I got like the 30 for 30 box, but, um, here you go. Okay. It's pretty good. It's um. It reminds me of like Dr. Pepper, kind of. I like it. I'll probably give this eight out of ten. All right, now we got, um, chicken wing Cheetos. Yeah. One is. Hold on. Kind of sweet, but I don't get like too much of a chicken flavor. It's okay. I'll probably give this probably like a five out of 10. Alright, now we got, um, a peach, like white peach filled, like chocolate stuff. Like it maybe like a chocolate wafer. Okay, so this is what it looks like. It's like. Looks like a chocolate, like wafer. Let's see the inside. Oh, god. It's like white in this inside. It's not what I would expect. It's pretty good though. I feel like it doesn't match up too good. I'll probably give that six out of 10. Um, we'll try one more before I get off. We got these Oreos. All right. They're out of yellow. OK. Not too sure what it is. Maybe, like, coffee? I don't know. It's pretty good, though. I'll probably give these, like, a six out of 10, too. Well, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1213,
        "commentCount": 11900,
        "diggCount": 105200,
        "playCount": 569900,
        "shareCount": 1255
      }
    },
    {
      "post_id": "7571259716605726007",
      "description": "#mid #fyp #viral #schoollunch #him ",
      "create_time": 1762821287,
      "transcript": "Hi, my name is Davis, and this is day 26 of reviewing school food. Um, it's another repeat day, so. Sorry. Got a cheese bites for a marinara. Not that great. Um, they're just really. Just bad. They're really, like, wet. 4.5 out of 10. Right now we got, um, tater tot, a little bit ketchup. Very, very mediocre. Cooked it. Cook longer. Five out of 10. Corn. How's the porky taste? Not that great. Five out of 10. Right now we got, um. Seven out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 569,
        "commentCount": 1691,
        "diggCount": 60700,
        "playCount": 408900,
        "shareCount": 794
      }
    },
    {
      "post_id": "7570456581024877838",
      "description": "#bajablastpie #bajablast #tacobell #good #him ",
      "create_time": 1762634315,
      "transcript": "My name is Davis. Today we got, um, the ball hall blast pie. I've seen some stuff about this. Kind of excited. Um, let's just get into it. OG. Da. Um. Alright, so I got a little bit of ball blast here. I got the ball blast to like, compare. Okay, yeah. So the pie is like, sort of like the ball of last. Um, it's. The filling is really, like, sticky and the cream is really sweet. Um, I'll probably give this like, like a 7 out of 10. It's pretty good. It's like, kind of hard to explain, though. Um, apparently there's only like 12 in each location, so I'm very happy I got one to review for you guys. I'll probably give this, yeah, like 7 out of 10. Well, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1794,
        "commentCount": 1846,
        "diggCount": 105500,
        "playCount": 740200,
        "shareCount": 5856
      }
    },
    {
      "post_id": "7570100193492782350",
      "description": "#fyp #viral #schoollunch #him #mid ",
      "create_time": 1762551338,
      "transcript": "My name is Davis. This is day 26 of reviewing school food. Um, today we got the. The rib sandwich with some barbecue sauce. Um, the bread is pretty good. It's very dry, though. The barbecue sauce definitely, like, kind of carries it. Overall, it's. It's pretty good, though. Like, with the barbecue sauce. I'll give it a 7 out of 10. Alright, now we got, um, Taylor Farm grapes. Alright, let's see. Oh, well, they're, um. They're mushy, not crunchy. Um, which is kind of unfortunate. They're still pretty good, though. Like, they're definitely not the best grapes, though. I'll give it five out of 10. Alright, now we got a zero sugar story. Okay. Pretty good. It's pretty similar to the zero sugar, um, Sprite. I'll give it eight out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 573,
        "commentCount": 1532,
        "diggCount": 62500,
        "playCount": 458800,
        "shareCount": 902
      }
    },
    {
      "post_id": "7569717058095598861",
      "description": "#fyp #viral #schoollunch #yum #him ",
      "create_time": 1762462110,
      "transcript": "My name is Davis, and this is day 25 of reviewing school food. Um, sorry I haven't really been posting. I've been sick. And also, um, there's pretty a CTS this week, but, um, here we go. First we got a original Doritos. Okay. Pretty good. I mean, I feel like everyone tried a Dorito. I'll give it a 7 out of ten. Right now we got the Turkey and cheese sub. I put lettuce, tomato, mustard, and I'm gonna put some Doritos on there. We'll. We'll do that. Alright. Alright, here we go. Hello. Um, the cheese is fake American cheese, so it's not that great. The Turkey is really good. The mustard is good. Um, just regular Heinz mustard. Um, yeah, overall it's pretty good. Um, I'll give it 6.5 out of 10. Alright, now we got, um, zero sugar Sprite. How dare you disobey? Alright, pretty good. Deer sugar fries. Like, can't really taste that as diet. I'll give it 8.5 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 673,
        "commentCount": 1980,
        "diggCount": 69900,
        "playCount": 430300,
        "shareCount": 1037
      }
    },
    {
      "post_id": "7569307182643072311",
      "description": "#buffalowildwings #yum #fyp #viral #him @Buffalo Wild Wings those tenders were so good ",
      "create_time": 1762366703,
      "transcript": "My name is Davis. Today we're at Buffalo Wild Wings. Uh, how to come back? Um, let's get into it. All right, for the first, we got the. The cheese bites, and then the. The chicken tenders. Um, they gave me caramel. They said, like, that's the signature for the cheese sauce. So let's see how it is. Alright. Okay. The grandma was actually really good. Like, I was kind of surprised. Yeah, the cheese, the grandma was really good with the, um. Like, with the breading. It's kind of like, I guess, funnel cake kind of. And then the cheese is also really good. It actually pairs really good. I'll give that eight out of ten. Alright, now we got, um, the chicken tenders, and then we have this. The same sauce as last time. It's like. I think it's like Chipotle or something. See how it is. Okay. I bit my lip. Has a nice crunch. That's definitely really good. Oops. That sauce, it. I don't know what it is, but it's pretty good. Um, nice crunch. The breadings, like, seasoned, which is good. I'll give the chicken tenders, uh, 8.5 out of 10. Alright, now for the most important part of the meal, dessert. We got the, um, the skillet cookie. So, yeah, let's see how it is. There's ice cream, chocolate chip cookie, and whipped cream on top. Come on. Pretty good. Um, the I. Something I didn't notice was the cookie wasn't cooked. All the Way through, um, but, I mean, other than that, it's still really good. Like, I mean, it's. It's cookie with ice cream. Like, obviously it's gonna be pretty good. I think the only thing that could have made this better, um, is the cookie being cooked longer. I'll give this an 8 out of 10. Well, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 677,
        "commentCount": 1372,
        "diggCount": 57200,
        "playCount": 357400,
        "shareCount": 853
      }
    },
    {
      "post_id": "7568977571996601614",
      "description": "#fyp #viral #yum #him #schoollunch ",
      "create_time": 1762289953,
      "transcript": "My name is Davis. Um, today we're reviews, uh, my home food, bring it to school, pack my lunch today. Since it was Cheesy Bites. Um, I've already done that twice. So first we got a chicken quesadilla. Okay. Pretty good. Um, I wish it was still warm. It's kind of hard to do that, though. I mean, I'll give it seven out of 10. It's pretty good. And now we got, um, the Harvest Cheddar. Um, Sun Chips. Mm. Go. Really good. I'll give it an eight out of 10. Oh, now we got honey Stinger energy waffle. Pretty good. Cookie and cream flavor. Um, it's alright. I'll give it five out of 10. Alright, for today's drink, we got diet green tea, citrus, uh, lemon. Gabe got me this. Alright. There, there, there's a bee. I got it. Um, it's kind of. Kind of, um. What's the word I'm looking for? It's like, um. It's, um. It's not sweet, though. I'll give this six out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 385,
        "commentCount": 1055,
        "diggCount": 43200,
        "playCount": 261700,
        "shareCount": 516
      }
    },
    {
      "post_id": "7567587924112428301",
      "description": "#fyp #viral #halloween #yum #him ",
      "create_time": 1761966390,
      "transcript": "My name is Davis. Uh, just got back from trick or treating. We walked about 1.5 miles. Um, this is a bag of candy. I'm gonna pause the video, and I'll get back to you once this, um. Haha, this is the bowl. Uh, here. This is all the candy we got. Um, let's see. This is my favorite, if you guys have never had these. Um, Jolly Rancher gummies. Here, I'll try one for the camera. These are so good. They have such a good texture. Gummy. I mean, I'll probably give these, like, a 9 out of 10. Um, yeah, this is all the stuff I got. Got a few of king sizes, which is great, but, um. Yeah, comment below your guys's favorite candy. And, um. Yeah, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 793,
        "commentCount": 2683,
        "diggCount": 71500,
        "playCount": 507400,
        "shareCount": 1201
      }
    },
    {
      "post_id": "7567113282427931918",
      "description": "#fyp #viral #him #schoollunch #yum ",
      "create_time": 1761855870,
      "transcript": "My name is Davis, and this is day 24 of reviewing school food. Alright, we got a spaghetti today. The spaghetti is always pretty good. I'm always happy when we have spaghetti. I'll give it eight out of 10. Alright, now we got a breadstick. Gotta get in on the sauce. Pretty good. Nice and soft. Nice and garlicly. I mean, it's pretty good breadstick. I'll give seven out of 10. All right, now we got a salad without ranch. Okay. Pretty good salad goods. Six out of 10. Alright, today's drink is strawberry lemonade. Zero sugar. Alright. I think I like this more than the regular lemonade. Um, it's pretty good. It's not too sour, which is good. I'll give it seven out of 10, too. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 738,
        "commentCount": 1759,
        "diggCount": 80000,
        "playCount": 488700,
        "shareCount": 1242
      }
    },
    {
      "post_id": "7566704502070463758",
      "description": "#fyp #him #mentalhealth #viral #amazing was so much fun I’m glad I went ",
      "create_time": 1761760728,
      "transcript": "My name is Davis. Today we're at Atlantic Mall and billiards supporting Anthony's Way, which is about teen mental health awareness. Let's go check it out. All right, first we got some lemonade, blue raspberry and mango. Um, I wish there's more blue raspberry flavor. I'll give it seven out of 10. Still really good. Alright, now we got mango. Mangoes a lot better. I'll give the mango eight out of 10. Alright, I'll see you at the next stand. Alright, now we got some uh, wings from put at the food truck real quick. Alright, here we go. Uh, garlic parmesan and lemon pepper. That is really good. For food truck. That is amazing. That's really good wings. I'll give that 8 out of 10. Alright, some lemon pepper. I'll give the garlic. I think the garlic pepper sort of better, but not by much. I'm also gonna give the weapon pepper 7 out of 10. Alright, now we got some more fries. Putting ranch on them. I like it with the other ranch more. I'll give the fries 6.5 out of 10. Alright, I'll see you guys around. Alright, now we're playing shuffleboard. Here we go. This is my first time ever playing, so let's see how I do. Alright, let's see. So one. Alright, one. Camera man. You can speak camera man if you want. I mean, please. Two, three. Two, three. No. Alright, here we go. Third shot. That's too fast. Wait, wait. Ah, alright, last. One. Here we go. Please don't be off two points. Alright, well, I'll see you guys at the next day. Now we got some ski ball. Got four rows. Let's see how I do. Wait, oh, close to the 50, actually. Alright, here we go. I'm gonna hit that 50, I know it. Oh, that's why I'm a big dog. I'll see you later.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1051,
        "commentCount": 2195,
        "diggCount": 81000,
        "playCount": 426000,
        "shareCount": 936
      }
    },
    {
      "post_id": "7566414605166136590",
      "description": "#fyp #viral #him #schoollunch #good ",
      "create_time": 1761693210,
      "transcript": "My name is Davis, and this is day 22 of reviewing school food. Today we got a chicken fajita burrito. I put a Texas Pete and, um, sour cream. So let's see how it is. Pretty good. There's cheese in there, too. But look at how bad this thing rolled up. I'll give it seven out of 10. The chicken is really nice. It's nice and seasoned. Um, my burrito wrapping skills was actually pretty good today. So seven out of 10. Alright, now we got some cucumbers. Pretty good. I mean, it's just cucumbers. Um, there's no dressing on or anything. I mean, six out of 10. Well, see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1243,
        "commentCount": 2156,
        "diggCount": 128400,
        "playCount": 863000,
        "shareCount": 1806
      }
    },
    {
      "post_id": "7566026545400122637",
      "description": "#fyp #viral #him #schoollunch #good ",
      "create_time": 1761602860,
      "transcript": "My name is Davis, and this is day 22 of reviewing school food. All right, uh, we got a meatball sub today. Pretty good, I'll give it. Um, it needs more meatballs, um, and probably more meat sauce. 6.5 out of 10. Now we gotta fry. I'll try it with ketchup and without ranch. The ranch is kinda weird today. It's like, really sour. With the ranch, 3 out of 10. With the ketchup, 4 out of 10. Yeah. Alright, now we got, um, carrot. Enjoy your carrot. I mean, six out of 10. Right now we got zero Sugar Mountain Dew. Pretty good. I'll give it 8 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 695,
        "commentCount": 1707,
        "diggCount": 75200,
        "playCount": 455000,
        "shareCount": 1290
      }
    },
    {
      "post_id": "7565605377929137463",
      "description": "@Davieunderwater love your content and so happy we were able to collab❤️  #fyp #viral #elcerrogranda #yum #him ",
      "create_time": 1761504791,
      "transcript": "What's up, guys? My name is Davis. Today we're at El Centro Grande with my boy Davy underwater. How's it going? Um, I'm ready to eat. This is one of my favorite, uh, Tex Mex joints, so let's check it out. Alright, let's see. Let's go. Alright, so now we're in here. Um, we got awkward, you know? Yeah. Yeah. I want. I want it being. Yeah, yeah. Alright, so here we go. Cheers. Cheers. Pretty good. I don't. I feel like it's definitely. It tastes fresh. Like, it definitely tastes kind of fresh. I'll give it nine out of 10. Nine out of 10. Yeah. Yeah, I give it a 10 out of 10. I love it. Nice, nice. Alright, so now we got some, uh, chips and queso. Here you go. Alright, here we go. The cheese is really good. I think you could use some more seasonings or, like, a little bit more flavor. Um, what I really like is having, like, maybe, like, some jalapenos in there, some tomatoes in there. I'll give it 6.5 out of 10. Yeah, I. I give it a solid seven. Solid seven. All right, I'll see you guys when the main course comes out. I got the carne asada, um, tacos. I got the Texas fajitas. All right, here we go. Cheers. Cheers. Um, mine's really good, but really dry. Um, I'm probably gonna put some more, um, salsa and my case on there, make it better. The meat's really good. Though I'll give it 7 out of 10. Nice. Um, I enjoy. It has really good flavors. Um, I give this a 9 out of ten. Now we got some dessert. First we have one. Yeah, I think this is one. Alright, here we go. Cool. That is good. That is delicious. Um, 10 out of 10 to me. Also 10 out of 10. I mean, that cake, nice and warm, nice and soft. The caramel on top, the ice cream on top, that is amazing. Just melts in your mouth. Yeah. All right, now we got some, uh, Tres leche cake. Uh, this is my first time ever trying it, so see how it is compare to other Tres leches cakes. Where would you say this is okay? Compared to other Tres leches cakes, this one's a little bit harder. I would say this is uh. I think it's just too sweet for my. Probably for like a just. Let's just cake. Oh, well, I give this a seven out of 10. All right. Um, it's my first time ever having a just. Let's just cake. Uh, I definitely like the full sensation about it. I'll give it 6.5 out of 10. Alright, guys. Well, that was today's video. Overall so good. Um, the food was really good, especially the dessert. And um, the service was like 10 out of 10. Um, what do you think, David? Um, I love coming here. Uh, I used to eat here multiple Times a week. They're always very consistent. The food is flavorful. I give it an overall 9 out of 10. I always enjoy my experience here. And if you guys are in Wilmington, North Carolina, make sure to come to. What's that over there? Alright, well, it was love to collaborate with you guys. Thank you, Davie Davis. Yeah, we gotta collaborate again. For sure. Let me know how you guys enjoyed today's video.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 2045,
        "commentCount": 2424,
        "diggCount": 99200,
        "playCount": 735900,
        "shareCount": 1551
      }
    },
    {
      "post_id": "7564918210517044494",
      "description": "#fyp #viral #schoollunch #good #him ",
      "create_time": 1761344806,
      "transcript": "My name is Davis and this is day 20 or 21 of reviewing school food. Alright, today we got um, grilled cheese. Looks pretty good. These are pretty good. Um, I love the grilled cheese is here. Only thing they don't have the tomato soup. That makes it so much better. 8.5 out of 10. Curly fries. They're a little cold with the curly fries they like. They cool off so fast so it's hard to get them warm. Good seasoning though. Curly fries. 6 out of 10. Alright, we got carrots. Pretty good. 7 out of 10. Applesauce. I love applesauce. 9 out of ten. Alright, for today's drink, we got zero sugar lemonade. Shout out Gabe for getting me this. Love Gabe. Are you guys pretty good? It has like a weird taste though cause of the zero sugar. I'll give it 6.5 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1300,
        "commentCount": 2762,
        "diggCount": 126600,
        "playCount": 794400,
        "shareCount": 2036
      }
    },
    {
      "post_id": "7564538026064481549",
      "description": "#fyp #viral #him #schoollunch #good ",
      "create_time": 1761256271,
      "transcript": "My name is Davis, and this is day 20 of reviewing school food. Alright, today we got, um, chicken Alfredo. Hmm. Pretty good. Um, the chicken has really nice seasoning, which I'm very surprised about. And the cheese sauce is also really good. I'll give it 8.5 out of 10. Alright, now we got a breadstick. Pretty good. Nice and garlicky. I'll give it seven out of 10. Alright, let's put the Alfredo on top of the breadstick. Eight out of 10. I guess it kind of, like, matched the flavor of the cheese and stuff. Eight out of 10. And now we got carrots with some ranch. Pretty good. Um, 7 out of 10. Cherry, uh, Cherry Pepsi. Pretty good. Um, it's definitely not like my favorite zero sugar soda. There's also some more zero sugar sodas, um, up there, and you have to pay extra, but it's fine. Um, I'll make sure to start reviewing those, too. Um, zero sugar, uh, Cherry Pepsi. 7.5 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1166,
        "commentCount": 3515,
        "diggCount": 116000,
        "playCount": 676700,
        "shareCount": 2122
      }
    },
    {
      "post_id": "7564156852917882167",
      "description": "#fyp #viral #him #schoollunch #mid ",
      "create_time": 1761167538,
      "transcript": "My name is Davis, and this is day 19 of reviewing small food. Uh, right now we got a chicken sandwich. I'll put some ketchup on there. Pretty good. Um, I had to redo the TikTok, so I already took a bite. The first bite was really spicy. This one's not spicy at all, which shows that it's, like, inconsistent with the spice level. I'll give it a four out of 10. Alright, now we got some, uh, corn. What? Man, I feel like they need to, like, put salt and pepper packets up there. Like, that corn has no seasoning. Um, 5 out of 10. Now we got the tater tots. I'm not seeing these in a while. Ever since our, uh, incident with, like, episode 3 or 2. Alright, here we go. There's a wall. Where is it? Very much again. Um, four out of 10. Right now we got a salad. I'll put ranch on there. The lettuce is not that. Um, the lettuce is not that. The lettuce is, like, wilted. It's not that great. Um, I'll give today's salad a four out of ten. Alright, now we got zero sugar, blackberry, Dr. Pepper. Okay, that's really good. I love Dr. Pepper. I'll give the Blackberry eight out of ten. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1226,
        "commentCount": 3641,
        "diggCount": 120800,
        "playCount": 780400,
        "shareCount": 2425
      }
    },
    {
      "post_id": "7563755040070995214",
      "description": "#fyp #viral #schoollunch #mid #him ",
      "create_time": 1761074001,
      "transcript": "My name is Davis, and this is day 18 of reviewing school food. Today I got the cold lunch. So first, let's start with this salad. I'll give it 6 out of 10. Alright, now we gotta grape jelly. Uh, uncrossable. Um, I feel like everyone's had it on trustable. I mean, it's pretty good, but it's just a BB and J. 6 out of 10. Or now we got, um, watermelon flavored. Uh, crazy. It's very good. Um, I definitely like these. Every time I get school lunch, I love these. 7 out of ten. There's a whole grain. Okay. Um, since there's a whole grain, they're not as good. Five out of 10. Now we got a barbecue baked beans. Super good. Not as good as the cheese ruffle ones. Um, six out of 10. Alright. And last but not least, uh, string cheese. Ja, pretty good. It's just cream cheese. Seven out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 859,
        "commentCount": 3037,
        "diggCount": 85400,
        "playCount": 538500,
        "shareCount": 1272
      }
    },
    {
      "post_id": "7563417324812766519",
      "description": "#fyp #viral #schoollunch #mid #him  thank you for 700k🎉🎉🎉",
      "create_time": 1760995349,
      "transcript": "My name is Davis, and this is day 17 of reviewing school food. We're in the SOR office, the sheriff's office, I guess. Resource officer office. Um, today we got popcorn chicken, Mac and cheese and uh, broccoli. Um, so here we go. I'll try it like on its own and then together. Alright. Mac and cheese super bland. Like, this was pure plastic. I feel like that cheese. Um, three out of 10. Alright, popcorn chicken, ketchup. Pretty good. It's not like too bland, but I mean, the chicken meat just. It looks funky. Um, popcorn chicken. I'll give it five out of 10. I'm trying to be like, more harsher, you know? Um, here, let's try it together though. Pretty good. Um, six out of 10. Alright, now we got broccoli. Broccoli is pretty good. Um, need some, like, salt or like pepper. Need some seasoning. Um, I actually like broccoli quite a lot, so I'll give the broccoli a 6 out of ten. Alright, now we got, um, peaches. Not as good as to uh, today. It's not that great. Um, I'll give it a 4 out of 10. Well, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1625,
        "commentCount": 3865,
        "diggCount": 139100,
        "playCount": 867800,
        "shareCount": 2409
      }
    },
    {
      "post_id": "7562976769163218189",
      "description": "#cookout #fyp #viral #him #good ",
      "create_time": 1760892787,
      "transcript": "My name is Davis, and today we're reviewing cookout. I got the cheddar style burger, uh, chicken quesadilla, and then Cajun fries. My name is Clay, and I got the regular cheeseburger, the regular fries, and chicken nuggets. Alright, so let's try out the burgers first. Pretty good. Um, it's good flavor. I wish I could taste like, the bacon more. Needs more of a bacony taste. A lot of cheese on it, which I mean, is always good, and grilled onions. It's pretty basic burger. I feel like it needs a little bit more flavor, though. Well, bland. I'll give mine a 6.5 out of 10. Mine. Mine was really good. It's plain, just cheese and lettuce on it, but it has a lot of salt, but I love salt, so I'll give mine an 8 out of 10. Alright, now we got, um, the fries. I got Cajun, he got regular. They definitely hooked me up with the Cajun seasoning, which I like. Very good. Um, it's not really crunchy, though. They're. They're. I mean, I feel like cookout always has like, soggy fries, though. They're still really good. I'll give it seven out of 10. Yeah, I agree. They're a little bit soggy. Nothing wrong with them. Six out of 10. Alright, and then I got the chicken quesadilla, he got, um, chicken nuggets. So Chicken Casey is really good. Like, for this being like, a burger spot kind of. Chicken Casey is really good. I'll give It eight out of 10. It has good seasoning. And I'd say the chicken nuggets, normally maybe a four out of 10. Three out of 10. They actually did the chicken nuggets really well this time. I'll give it a six out of 10. It's pretty good. Alright, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1073,
        "commentCount": 2879,
        "diggCount": 98000,
        "playCount": 641100,
        "shareCount": 1197
      }
    },
    {
      "post_id": "7561906785305611534",
      "description": "#fyp #schoollunch #viral #mid #him ",
      "create_time": 1760643637,
      "transcript": "My name is Davis, and this is day 16 of reviewing school food. Uh, today we got a corn dog. I put a ketchup and mustard on it. The bread's like, really dry. Like, it's definitely like one of those frozen. Like, I know it's one of the frozen ones, I guess, but it's just really dry. It's not that great. Like, it definitely could have been cooked longer. I feel like that would have definitely helped it out. I'm gonna give it a 5 out of 10. Alright, now we got a cinnamon apples. That's depressing. Very good. So this apple pie filling, it's really good. I'll give it a 7 out of 10. Well, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1171,
        "commentCount": 3460,
        "diggCount": 115400,
        "playCount": 807700,
        "shareCount": 2868
      }
    },
    {
      "post_id": "7561521738060778765",
      "description": "#fyp #schoollunch #viral #principalsoffice #him ",
      "create_time": 1760553990,
      "transcript": "Go. My name is Davis, and today we're in the principal's office reviewing school food. This is a day 16. All right, first we got some cheese bites. Let's get some marinara. Okay. Um, I feel like they need more crisp. Um, here, the cheese ball. There's. There's not really. They're very soggy. Um, they taste fine, though. It's definitely not my favorite school lunch, but I'm not mad about it. Uh, I'll give it six out of 10. Alright, now we got, um, buttered corn. Um, feels like it needs, like, some salt, maybe some pepper. Um, five out of 10? No, four out of 10. Um, alright, now we got some sweet potatoes. They kind of look suspicious. Let's see how it is. Um, I feel like they could be cooked a little bit longer. They're pretty good, though. Sweet. Sweet potatoes also, like, isn't my, like, favorite. Give them. I'll give them a 5 out of 10. Now I got a banana. I love bananas. Um, I'll give it a 9 out of 10. Expect the principal soon. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 3047,
        "commentCount": 6775,
        "diggCount": 232500,
        "playCount": 1600000,
        "shareCount": 6100
      }
    },
    {
      "post_id": "7561171790286966030",
      "description": "",
      "create_time": 1760472535,
      "transcript": "My name is Davis, and this is Day 14 of reviewing school food. I said Day 13 twice, so I guess. No, it's Day 15. I'm sorry. Alright, we got a walking taco today. I have Doritos meat, cheese, lettuce, and then some Tupito's hot sauce. Give it a try. No sour cream today, which is unfortunate. Oh, and we have rice in here. Um, one of my favorite meals. Maybe. Maybe my number one favorite meal. I don't know. It's missing the sour cream and stuff. As far as there's, uh, last weeks or two weeks ago, um, eight out of 10, we got, um, peaches, I think. Um, so candy. Peaches is very good. Seven out of 10. We got a Rice Krispie treat. I mean, Rice Krispie and marshmallow. It's so good. And these remind me of my childhood. My grandma used to always have these. Um, nine out of 10. Now we got apple juice. I mean, it's just apple juice. It's. It's pretty good. Um, seven out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1851,
        "commentCount": 3698,
        "diggCount": 146900,
        "playCount": 1000000,
        "shareCount": 3615
      }
    },
    {
      "post_id": "7560811908505324814",
      "description": "#schoollunch #fyp #him #yum #viral ",
      "create_time": 1760388736,
      "transcript": "My name is Davis, and this is day 13 of reviewing school food. Today's episode is gonna be a little quick since we don't really got a lot. Um, I think this is just a cheese quesadilla. I mean, it's pretty good. Um, it's just tortilla and cheese, but, I mean, it's better than most school lunches. Seven out of 10. Alright, now we got, um, some pineapple. Um, mediocre. Six out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1792,
        "commentCount": 4253,
        "diggCount": 160500,
        "playCount": 1400000,
        "shareCount": 3169
      }
    },
    {
      "post_id": "7560398757758602510",
      "description": "#daveshotchicken #yum #him #fyp #viral ",
      "create_time": 1760292537,
      "transcript": "My name is Davis, and today we're reviewing Dave's Hot Chicken. First we're gonna review, like, the meal and then the extra hot tender, which is, um, 200,000 Scoville units. The Wingstop one was for sure not. It was probably like 100,000. So stay tuned for that. Um, first we got a. The slider and then we also got. No, hold up. This big thing is sauce. Alright, we're gonna try with, with and without the sauce. I really like this hot. Um, 8 out of 10. I got a medium. Nine out of 10. Fries. Pretty good. Um, they're not the best fries ever. Hmm. Seven out of 10. Alright, stop. Alright, um, here's the tender. Uh, I peeled off a piece for the cameraman. Um, but here we go. Here. I'm. I'm not gonna see sauce. And I got some milk. We'll see how long I can last without it. Um, is. This one is more mouthy than Wingstop. Uh, I wanna also wanna thank for 600 k. Um, crazy. This is bad. I was gonna do the reaper, but it's 1.5 million. I'm not doing all that. Æ well, thank you. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 3200,
        "commentCount": 7463,
        "diggCount": 206200,
        "playCount": 1600000,
        "shareCount": 6705
      }
    },
    {
      "post_id": "7560072751130692919",
      "description": "#chipotle #fyp #viral #good #him ",
      "create_time": 1760216643,
      "transcript": "My name is Davis, and today we're trying chipotle. Um, in my bowl I got rice, uh, corn salsa, um, queso cheese, pita de Gallo, sour cream and lettuce. And then I also got some guacamole. We'll, uh, we'll try with and without the guacamole. Alright, so, uh, first without. Always good. Um, I love Chipotle. Uh, this is my first time having the carne asada. Uh, here, let me get a good bite of it. Um, I love carne asada. Um, the Chipotle kind. Very good. Um, I definitely like it a lot. Um, so without the guacamole, eight out of 10. Um, I mean, I love Chipotle, so. Alright, let's uh, let's try with the guacamole. So good. Um, I mean with the guacamole. 9 out of 10. Now we got the, the Fresca Berry Aqua, I think. Yeah, try how it is. That's the for sure my go to drink from, um, Chipotle. I'll give it a 9 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1569,
        "commentCount": 3692,
        "diggCount": 122000,
        "playCount": 887000,
        "shareCount": 2297
      }
    },
    {
      "post_id": "7559702555010419981",
      "description": "#fyp #viral #schoollunch #him #mid ",
      "create_time": 1760130461,
      "transcript": "My name is Davis, and today, I think this is day 13 of reviewing school food. Alright, first we got um, a burger. I put lettuce and ketchup on there. Um, it's not terrible. It's not really great though. Um, the burger patties like almost, like not real, I guess 6 out of ten. Alright, now we got um, curly fries. They're actually warm today, which is good. Alright. Ketchup, pretty good. Um, no crunch, but I do like the flavor a lot. Um, I'm gonna give them a 5 out of 10. Alright, uh, now we got white milk. Um, I'm basically gonna just try all the melts. Like, I've done chocolate, strawberry, now I'm doing white, and then I'm probably never gonna review them again. Um, but here we go. I mean, I love milk. It's probably like top three drinks for me. Um, nine out of 10. I, I love milk a lot. So, um, I think it goes chocolate, vanilla and strawberry. Alright, now we got um, a cookie to try. I try without and with the milk. Um, I'll give the cookie a 5.5 out of 10 without the milk and a 6 out of 10 with the milk. Now we got, um, oranges. I think it's an orange or, or it's like grapefruit. Grapefruit or something. I think it's grapefruit. I'll give it seven out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 3380,
        "commentCount": 5620,
        "diggCount": 210800,
        "playCount": 1700000,
        "shareCount": 6022
      }
    },
    {
      "post_id": "7559314998103788814",
      "description": "#hispanicheritagemonth #fyp #viral #good #him ",
      "create_time": 1760040190,
      "transcript": "My name is Davis. Today we're at the Hispanic Heritage Expo. There we go. Alright, first thing we got today is a quesadilla. I have a little bit of lettuce on there. Pretty good. Um, kind of bland. I'll give it five out of 10. Now we got, um, I'm not really too sure what this is. Um, it's like a crispy tortilla with chicken inside. Um, it's a corn tortilla. I'm not a corn tortilla guy. Um, a little dry, but the meat is really good. Six out of 10. I'll see you at the next stand. All right, now we got, um, some chamoy and Tajin. Uh, peaches. Sticky. Pretty good. I'll give it an 8 out of 10. I like your boy stuff. So 8 out of 10. I'll see you at the next food. All right, now we got, um, some apples with your boy. Some like, Mexican candy and stuff. Uh, I think it's watermelon or something. I gotta get it out. Very good. I think I like it more than the beach drinks. I'm gonna give it an 8 out of 10. Like, no, 8.5. I'll see you at the next food. All right, now we got some horchata. Wow. First time ever trying it. Um, probably like 6.5 out of 10. Sorry guys, we couldn't go to any more booths though. I'll see you guys at lunch.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1688,
        "commentCount": 2914,
        "diggCount": 147800,
        "playCount": 1100000,
        "shareCount": 2507
      }
    },
    {
      "post_id": "7559304585341357367",
      "description": "#fyp #viral #schoollunch #review #him ",
      "create_time": 1760037767,
      "transcript": "My name is Davis and this is day 12 of reviewing school food. Alright, we got um spicy chicken sandwich. Uh today was chicken sandwich and pizza so there's nothing new. Um, sorry about that. So we'll try with a ketchup. Um mediocre again no crunch. Um it is kind of spicy today which is good. The bread could be better. No crunch on the chicken 6 out of 10. Alright, now we'll try with the ranch. I like it more with um ketchup. I'll give it I'll give it with the Ranch of 5.5. Alright, now we got um strawberry milk. Can you give me one tomorrow? Alright, I'll throw your food away. I just don't want you taste it. I prefer chocolate milk over strawberry milk. Strawberry milk is okay. Um, I'll give it like a 5 out of 10. Now we got sweet Chili Doritos. Pretty good. I feel like with the sweet chili you have to be in the mood for them compared to like the other Doritos. I'll give them a 7 out of 10. I think a good one is like Nachos, Spicy Nachos probably one of my favorite. All right, now we got a zero sugar Baja blast. Shout out Gabe for getting me this 9 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 2003,
        "commentCount": 5342,
        "diggCount": 168800,
        "playCount": 1400000,
        "shareCount": 4526
      }
    },
    {
      "post_id": "7558913525670776119",
      "description": "#fyp #viral #schoollunch #mid #review ",
      "create_time": 1759946716,
      "transcript": "My name is Davis, and I think this is day 11 of reviewing school food. Today we got, um, corn dog. I have ketchup with it. Um, I wish the brightening had crisp. Um, it's not that great. It's not like the worst school lunch, but it's definitely not the best. Five out of ten. Alright, now we got a salad. I, uh, I mixed Italian dressing and a little bit of ranch. Um, I like the combination. I made. Um, how much? I just did ranch. 6 out of 10. I know you guys have been asking for a drink, so, um, they have milk. I don't usually grab milk, but, um, I'll review it for you guys. Here we go. Pretty good, but it's just chocolate milk. Eight out of ten. Now today they got this, like, blue raspberry squeeze thing. Um, it's okay. Like six out of 10. Um, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 3734,
        "commentCount": 6097,
        "diggCount": 264600,
        "playCount": 2100000,
        "shareCount": 8164
      }
    },
    {
      "post_id": "7558573558402796814",
      "description": "#fyp #viral #schoollunch #good #him ",
      "create_time": 1759867566,
      "transcript": "My name is Davis. This is day 10 of reviewing school food. We got a meatball sub today that's really good. Um, the meatballs are really good, the bread is good, and cheese is good. Eight out of 10. Alright, now we got a cucumber salad. Here's more of the dressing. I'll give it five out of 10. Now we got a banana. It's just a basic banana. Eight out of 10. Alright, now we got, um, ruffles. Baked. The cheese kind. Pretty good. Um, I really like the baked chip. Um, 9 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 2969,
        "commentCount": 5970,
        "diggCount": 247300,
        "playCount": 1900000,
        "shareCount": 7357
      }
    },
    {
      "post_id": "7558211203458174222",
      "description": "",
      "create_time": 1759783208,
      "transcript": "My name is Davis, and today we're reviewing school food. Um, I think this is like day 9 or something. Um, here. Let's start off with a corn today. Pretty good. Nice and buttery. Um, for corn, there's better, but like corn and messed up corn. Seven out of 10. Um, now we got a chicken tender. It looks kind of weird, but let's see how it is. Now. Waiting for me is crazy. No crunch drink is not that good. Three out of 10. Alright, now we got, um, pizza slice. I'll try without and with ranch. It's. It's really not that good of a pizza. There's better pizzas. Like the Mexican one. I'll get a 4 out of 10 without ranch and 4 out of 10 with ranch. Not that great. Now we got bears. Really good. I like berries. Um, probably more than peaches and stuff. I'll give it a 7 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 4323,
        "commentCount": 8331,
        "diggCount": 311500,
        "playCount": 2800000,
        "shareCount": 11500
      }
    },
    {
      "post_id": "7557737653039402254",
      "description": "#acai #yum #breakfast #him #review ",
      "create_time": 1759672971,
      "transcript": "My name is Davis. Today we're trying the acai bowl. We got strawberries, coconut flakes, banana, Nutella drizzle, and obviously the acai. Um, I've never had one before, so let's see how it is. Go. Alright, now with the strawberry. 이거 응 it's very good. Not so you. It's kind of like a flavorless smoothie. Sort of. It's not. It doesn't have a lot of flavor, but it's really good with the banana and the strawberry. Um, I would eat it again for breakfast, but, like, it's definitely not my favorite thing. I rather have, like, eggs and, um, like bacon and toast. But, um, I'm gonna give it a 5 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1507,
        "commentCount": 2773,
        "diggCount": 127100,
        "playCount": 1000000,
        "shareCount": 2430
      }
    },
    {
      "post_id": "7557483016709295373",
      "description": "#fyp #viral #trickshot #hoopify #67 thank you for 450k followers ",
      "create_time": 1759613669,
      "transcript": "My name is Davis, and today we're trick shooting. I'll see you guys tomorrow. Davis, and today we're trick shooting. First try. My name is Davis, and today we're trick shooting. First try. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 785,
        "commentCount": 1309,
        "diggCount": 85500,
        "playCount": 889500,
        "shareCount": 660
      }
    },
    {
      "post_id": "7557183509081640206",
      "description": "#fyp #viral #mid #schoollunch #chicken REPOST got tooken down because of the kids in the back ground ",
      "create_time": 1759543925,
      "transcript": "My name is Davis, and this is day 8 of reviewing school food. Today we got a spicy chicken sandwich. Um, pretty good. No crunch. That's a little bit of cake, but not a lot. Um, 6 out of 10. I need to be harsher on my review, so I'm gonna start trying to be a little bit more harsher. 6 out of 10. Now we got a French fry. Six out of 10, too. Now we got a fish finger. I have a little bit of tartar sauce. Not terrible. Um, it's not really much crunch. I'm gonna try with ketchup. I like ketchup a little bit more. Um, 6 out of 10 with the ketchup. 4.5 out of 10 with the tartar sauce. Now we got a salad with the ranch today. Pretty good. Lettuce is good today. Um, six out of 10, too. I'll go, uh, orange. Um, a lot of seeds. Pretty good. Um, it's not the best. Five out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 804,
        "commentCount": 2067,
        "diggCount": 71000,
        "playCount": 707100,
        "shareCount": 1105
      }
    },
    {
      "post_id": "7557102150313184525",
      "description": "#fyp #viral #spicy #wingstop #collab ",
      "create_time": 1759524993,
      "transcript": "My name is Davis, and today we're, uh, we're trying atomic, uh, tenders from Wingstop. This is the highest. It's 200,000 Scoville units. I'll do it with my friend, uh, indie here. It's gonna be spicy. Alright, bro. Here we go, bro. Cheers. Cheers. Enggak. At the beginning, you don't really taste it. I'm very bad at spice. I can barely taste it right now. Um, I just want to say thank you for so all the followers. Um, soon to hit 4 400,000. I suck with spice. Oh my god. Alright, uh, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 4066,
        "commentCount": 6750,
        "diggCount": 260700,
        "playCount": 2200000,
        "shareCount": 9083
      }
    },
    {
      "post_id": "7556759729863724301",
      "description": "#viral #fyp #him #texasroadhouse #good thank you for 300k ❤️",
      "create_time": 1759445263,
      "transcript": "My name is Davis, and today we're reviewing Texas Roadhouse. I just want to say thank you for 300 k. This was a meant for 100 k, but we're growing so fast, it's crazy. Um, so let's dig in. First we got a barbecue chicken. We'll see how it is. Mm, very good. A lot of barbecue sauce, which I like. A lot of good flavor. Now we got, um, a filet Mignon. Um, as for medium rare, this is like beef jerky. So we'll see how it is. Pause the video. Alright, just got done with the steak. Super overcooked, but the steak is one of my favorite foods. I still really like it. I'll give the six. I'll give the steak a 7 out of 10. Um, by the way, I review. I'm gonna review this based off other restaurants, and I review school lunch, like, based off of other school lunches. So the steak's a 7. The chicken is, um, an 8. Now we got steak fry. Super good. Got a little bit of a barbecue sauce on that. Really good. Very soggy. Because we got takeout. Um, probably a 7 out of 10, too. Now we got the Texas roll with cinnamon butter. So good. Always love these. Eight out of 10. Alright, now we got, um, a Caesar salad. Alright. Um, the lettuce is really good. It's nice and fresh. It's not, um, like, wilted or anything. Caesar salads also really like Caesar dressing. Is also really good. Not too much, but not too little. I'm giving that an 8.5 out of 10. Now we got the, um. The Texas onion. Here we go. So good. For sure, like, top 3 appetizers from, like, any restaurant. 9 out of 10. Thank you so much for her 300 K. I'll see you tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 7118,
        "commentCount": 9475,
        "diggCount": 436400,
        "playCount": 3000000,
        "shareCount": 11400
      }
    },
    {
      "post_id": "7556351402289712397",
      "description": "#good #fyp #viral #smoothie #him ",
      "create_time": 1759350201,
      "transcript": "My name is Davis and today we're reviewing Tropical Smoothie. We got the blueberry. This um. It's blueberries, strawberries and banana. Pretty good. Um. Really taste the blueberries. It's very blueberry. And the banana. Can't really taste the strawberry, but it's alright. Um, I'll give it an 8 out of 10. I'll see you guys tomorrow also.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 885,
        "commentCount": 1862,
        "diggCount": 83800,
        "playCount": 1000000,
        "shareCount": 882
      }
    },
    {
      "post_id": "7556336396600937742",
      "description": "#fyp #viral #him #schoollunch #mid ",
      "create_time": 1759346710,
      "transcript": "My name is Davis, and this is day 7 of reviewing school lunch. Today we got a chicken sandwich. See how this. We got, uh, ketchup on there. Not bad. Um, the chicken is not crispy at all. It needs a lot more crisp. The buns, not bad today. Um, 6.5 out of 10. Now, we got our curly fries today. Super cold. Um, they definitely have a lot more, um, flavor than the potato wedges. But these are really cold. I'll give them five out of 10. All right. Um, applesauce. Uh, we do applesauce quite often. Just seven out of 10. Alright. I have a salad. Italian dressing. It's alright. Um, lettuce is not as good as last week. Um, the dressing definitely makes it taste a lot better. I'll give it six out of 10, too. All right. Um, now we got oranges. Haven't done these, so here we go. Let me get that out. Alright, here we go. Love oranges. Um, definitely juicy. Definitely really good. Seven out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 12500,
        "commentCount": 11500,
        "diggCount": 579500,
        "playCount": 8600000,
        "shareCount": 43500
      }
    },
    {
      "post_id": "7555949335674981645",
      "description": "#fyp #viral #schoollunch #him #yum",
      "create_time": 1759256591,
      "transcript": "My name is Davis, and this is day 6 of reviewing school food. Today we got a walking taco. Get a close up. Dude, this looks so good. Actually, I'm kind of excited. Oh, here we go. That's actually really good. That's a nine out of 10. That is really good. Actually, maybe 10 out of 10. I, I don't really know. We got the rice. It's alright. Still really bland. Six out of 10. Like, it has more flavor than last time, but six out of 10. Now we got a cucumber salad. Really good. I love cucumber. 8 out of 10. Alright, now we got a applesauce. Just plain old applesauce. Yo, Davis, can I get an autograph? After. After. Um, 7 out of 10. Pretty good. Now we got on peaches. You're the GOAT, babe. 7 out of 10. Um, I'll see you guys tomorrow. Thank you. Thank you for 100 K. Something big is in the works for tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 8119,
        "commentCount": 9424,
        "diggCount": 468600,
        "playCount": 4900000,
        "shareCount": 21500
      }
    },
    {
      "post_id": "7555578354791877901",
      "description": "#fyp #viral #review #schoollunch #aura ",
      "create_time": 1759170184,
      "transcript": "My name is Davis. This is day five of reviewing school lunch. Alright, we got um, I think it's sesame seed chicken or orange chicken. Let's see how it is. It's nice and sweet. Um, this will be a little bit warmer, but it's fine. Long line. Um, I give that a seven out of 10. Alright, now we got rice. I think it's fried rice, but we'll see how it is. It's okay. Um, it's. Holy cow. It's kind of grainy, I would say like, you know how you want your recipe fluffy. It's not that. It's kind of bland, but it's okay. Um, six out of 10. No, 5.5 out of 10. Alright, now we got um, curly fries and a potato wedges. So we'll see how they are. Alright, first we got curly fries. I really like the curly fries. 7 out of 10 too. Alright. And then potato wedge. Pretty good. I think I prefer the curly fries, but potato wedges, 6.5 out of 10. Now we got um, melon. Always really good. Um, you can tell it's pretty fresh. It's not like old or anything. It's pretty, pretty new. It's really good. Um, not dried out, has juice. And then now we got a pineapple. Just your basic pineapple. It's a little like, little too hard. I feel like. I don't know. Um, I'll give it like a six out of 10. Alright, I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 19900,
        "commentCount": 11900,
        "diggCount": 848400,
        "playCount": 9500000,
        "shareCount": 52200
      }
    },
    {
      "post_id": "7554909333792820535",
      "description": "#fyp #viral #review #thanks #icecream ",
      "create_time": 1759014434,
      "transcript": "My. My name is Davis, and today I'm just trying to say thank you for giving me 15 K followers. I did not expect to get that much. Just want to say thank you. Um, today we got a banana split. We'll. We'll rate it. Alright, here we go. Pretty good. I mean, who doesn't like ice cream? This is from a Brewers. All right. Uh, yeah. I mean, 10 out of 10. Come on, now. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 2231,
        "commentCount": 4657,
        "diggCount": 215000,
        "playCount": 2200000,
        "shareCount": 4242
      }
    },
    {
      "post_id": "7554524188732706103",
      "description": "#viral #fyp #review #him #schoollunch day 4 ",
      "create_time": 1758924744,
      "transcript": "My name is Davis and today we're reviewing school food. This is, um, Day 4, I think. Alright, we got a rib sandwich. The meat's pretty good. The bread is really stale though. 6.5 out of 10. Now we got a French fry. Put some ketchup on it. Let's see how it is. Pretty mediocre. French fries itself is pretty bland. Six out of 10 overall. Now we got a salad. Forgot to grab dressing, but it's alright. We'll see how it is. Pretty good. The lettuce is very nice. It has a nice crisp. Definitely enjoy that. Um, 6 out of 10 too. Now we got an apple. Has some weird marks, but we'll see how it is. I prefer Red Apples, 4 out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 7494,
        "commentCount": 9482,
        "diggCount": 414900,
        "playCount": 5300000,
        "shareCount": 37200
      }
    },
    {
      "post_id": "7554104881016048909",
      "description": "#fyp #viral #review #him #lunch ",
      "create_time": 1758827114,
      "transcript": "My name is Davis. This is day 3 of reviewing school food. Today we got a spaghetti that's actually very good. I'll give that an 8 out of ten. Alright, now we got, um, melon. Oh, it's really good. Eight out of 10. And then breadstick. Pretty, pretty decent. Seven out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 2586,
        "commentCount": 3696,
        "diggCount": 186200,
        "playCount": 3500000,
        "shareCount": 6538
      }
    },
    {
      "post_id": "7553780390721260855",
      "description": "#fyp #viral #review #schoollunch ",
      "create_time": 1758751582,
      "transcript": "My name is Davis. This is day two of reviewing school lunch. Today we got some type of sausage pizza, badass. I give it like 7 out of 10. We got rice, super bland. 4 out of 10. Pineapple. It's pretty good. Alright, I give this, wait, do you have the video? Uh, 7 out of 10 too. And then apple, cause you guys keep saying to eat it. Ew, that's nasty. 0 out of 10, bro. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 9331,
        "commentCount": 8280,
        "diggCount": 480200,
        "playCount": 5200000,
        "shareCount": 15400
      }
    },
    {
      "post_id": "7552977715729550606",
      "description": "#review #mid #fyp#viral the apple sauce was a 9/10 ",
      "create_time": 1758564718,
      "transcript": "My name is Davis, and today we're reviewing school food. First, chicken nugget. It's okay. It's kind of mid. I'll give it 6.5. Next, dinner thought. Fuck, fuck, fuck! That's so bad. All right, I'm boss. I'm gonna give the tater tot a one out of 10. Next, the breadstick. It's actually pretty good. I give this an 8 out of 10. Now, strawberry applesauce. That's very good. No, I think this is mango. Pretty good, too. Seven out of 10. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 2215,
        "commentCount": 3408,
        "diggCount": 175300,
        "playCount": 1900000,
        "shareCount": 6631
      }
    },
    {
      "post_id": "7552590674932157751",
      "description": "#fyp #viral #fishing ",
      "create_time": 1758474583,
      "transcript": "My name is Davis, and today we're fishing. Oh, we just got a warm out. Looks like, uh, it's very small, but it's alright. Alright, let's get a nice release on here. I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 474,
        "commentCount": 907,
        "diggCount": 49500,
        "playCount": 820000,
        "shareCount": 736
      }
    },
    {
      "post_id": "7552280490313534775",
      "description": "#huzz#tips#viral #fyp how to get the huzzz",
      "create_time": 1758402366,
      "transcript": "My name is Davis. Today we're asking the Huzz how to get the huzz. Hey, huzz, how do you get the huzz? Be yourself. Yeah, be yourself. Alright, thank you.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 2246,
        "commentCount": 2484,
        "diggCount": 156000,
        "playCount": 1900000,
        "shareCount": 5384
      }
    },
    {
      "post_id": "7551917281698221367",
      "description": "#fyp#huzz #tips #viral ",
      "create_time": 1758317776,
      "transcript": "My name is Davis. Today we're asking the Huss how to get the Huss. Hey, Huss, how do you get Huss? Um, you have to have money to get Huss. Well, I'm lucky. I'm broke.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 1207,
        "commentCount": 1071,
        "diggCount": 97300,
        "playCount": 1200000,
        "shareCount": 2116
      }
    },
    {
      "post_id": "7576466507966844215",
      "description": "#fyp #viral #friendsgiving #thanksgiving #him ",
      "create_time": 1764033604,
      "transcript": "My name is Davis, and um, today I'm trying my Friendsgiving for prayer club. Um, yeah, let's see how it is. So first we got this cookie dough dip. Um, I've never had cookie dough dip, so it seems pretty cool. Uh, with pretzel. Okay. I think it's like cream cheese base. It's pretty good. I like the salty sweet, uh, combo. Um, I'll probably give that 7 out of 10. Alright, now we got um, Pacific cooler for uh, Capri Sun. Okay. Not my favorite cause Korean sun. It's pretty good though. I think my favorite is probably like the lemonade or the cherry. Those are really good. I'll probably give this six out of 10. Alright, now we got pumpkin spice donut. Oh boy. Love pumpkin spice. Um, this is really good. I'll give this like a 8 out of 10. Alright, now we got a ham and cheese slider. Okay. Um. Oh, there's mayonnaise too. Somehow I got no cheese on my slider. Um, I'll probably give this eight out of 10. It's pretty good. Not the biggest male fan, but I don't mind if it's like just a little bit. Eight out of 10. Alright, now we got, um. Uh, Kentucky Fried Chicken. This is from I think Harris Teeter, so. Okay. No crunch. Good seasoning though. Um, I'll probably give that 7.5 out of 10. Well, that's everything. Thank you and I'll see you guys tomorrow.",
      "language": "eng-US",
      "source": "ASR",
      "is_original_audio": true,
      "music_author": "Davis_Big_Dawg",
      "stats": {
        "collectCount": 15,
        "commentCount": 170,
        "diggCount": 3293,
        "playCount": 18200,
        "shareCount": 69
      }
    }
  ]
}